Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:

df=pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})
import pandas as pd

def reindex_dataframe(df):

    new_index = pd.Series(range(1, 2 * len(df) + 1, 2))
    
    df = df.set_index(new_index)

    return df

reindex_dataframe(df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [34]:
a=pd.DataFrame(columns=["values"],data=[10, 20, 30, 40, 50])
a.head(3).sum()

values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [117]:

df = pd.DataFrame(columns=["Text"], data=["Pandas DataFrame", 'df', 'Python function'])
def fun(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()) if pd.notnull(x) and isinstance(x, str) else 0)
    return df
fun(df)

               Text  Word_Count
0  Pandas DataFrame           2
1                df           1
2   Python function           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size:

DataFrame.size returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and the number of columns.
It includes all elements, including NaN or missing values.

In [78]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)
df.size

6

DataFrame.shape:

DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element is the number of rows and the second element is the number of columns.
It does not include missing values in the count.

In [80]:
df.shape

(3, 2)

Q6. Which function of pandas do we use to read an excel file?

In this example, replace 'your_file.xlsx' with the actual path to your Excel file. The read_excel function is flexible and allows you to specify various options such as sheet name, header, index column, etc., to customize how the data is read.

In [116]:
a="AI total marks distribution.xlsx"

def fun(a):
    df=pd.read_excel(a)
    return df
fun(a)

      Roll Number                     Name  Mid-Term Marks  Quiz  Final  Total
0    22/11/EC/001              DIVYE JOSHI            23.0  18.0   35.0     76
1    22/11/EC/002             AKSHIT DUHAN             6.0  18.0   20.0     44
2    22/11/EC/003             MANAV SHARMA             7.0  14.0   12.0     33
3    22/11/EC/004             ADITYA SINGH            13.0  16.0   26.0     55
4    22/11/EC/005  SHASHANK SHEKHAR MISHRA            10.0  18.0   26.0     54
..            ...                      ...             ...   ...    ...    ...
112  22/11/EE/055           MAHENDER DHAKA             7.0  10.0   26.0     43
113  22/11/EE/056   PRATHMESH PRAKASH MORE            11.0  18.0   26.0     55
114  22/11/EE/057             ANKIT DHAKAR             2.0   8.0   10.0     20
115  22/11/EE/058          RITANSHU PRASAD             9.0  16.0   29.0     54
116  22/11/EE/059            RAUSHAN KUMAR             6.0  14.0   18.0     38

[117 rows x 6 columns]

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [113]:
data = {'Email': ['john.doe@example.com', 'Raman@example.org', 'Kishor@example.net']}
def fun(data):  
    df=pd.DataFrame(data)
    df["Username"]=df["Email"].apply(lambda x:(str(x).split("@"))[0])
    return df
fun(data)

                  Email  Username
0  john.doe@example.com  john.doe
1     Raman@example.org     Raman
2    Kishor@example.net    Kishor

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [111]:
data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}
def fun(data):
        df=pd.DataFrame(data)
        s1=df[(df["A"]>5) & (df["B"] < 10)]
        return s1
fun(data)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [108]:
a=pd.DataFrame(columns=["values"],data=[10, 20, 30, 40, 50])
a.mean()

values    30.0
dtype: float64

In [107]:
a.median()

values    30.0
dtype: float64

In [109]:
a.std()

values    15.811388
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [3]:
import pandas as pd
import numpy as np

# Create a sample DataFrame
np.random.seed(42)  # Setting seed for reproducibility
date_rng = pd.date_range(start='2022-01-01', end='2022-01-10', freq='D')
sales_data = np.random.randint(50, 100, size=(len(date_rng)))
df = pd.DataFrame({'Date': date_rng, 'Sales': sales_data})

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Function to calculate moving average
def add_moving_average_column(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

df = add_moving_average_column(df)

add_moving_average_column(df)

Original DataFrame:
        Date  Sales
0 2022-01-01     88
1 2022-01-02     78
2 2022-01-03     64
3 2022-01-04     92
4 2022-01-05     57
5 2022-01-06     70
6 2022-01-07     88
7 2022-01-08     68
8 2022-01-09     72
9 2022-01-10     60

        Date  Sales  MovingAverage
0 2022-01-01     88      88.000000
1 2022-01-02     78      83.000000
2 2022-01-03     64      76.666667
3 2022-01-04     92      80.500000
4 2022-01-05     57      75.800000
5 2022-01-06     70      74.833333
6 2022-01-07     88      76.714286
7 2022-01-08     68      73.857143
8 2022-01-09     72      73.000000
9 2022-01-10     60      72.428571

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [4]:
import pandas as pd

data={"Date":["2023-01-01",
"2023-01-02",
"2023-01-03",
"2023-01-04",
"2023-01-05"]}
df=pd.DataFrame(data)
def fun(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.day_name()
    return df
fun(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [7]:
def fun(df):
    df[(df["Date"]>='2023-01-01')&(df["Date"]<='2023-01-31')]
    return df
fun(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost library that needs to be imported to use the basic functions of pandas is the pandas library itself. You can import pandas using the following convention:

In [ ]:
import pandas as pd